# running in ecc_bmc/src/
read -sv rvecc_encode.sv
read -sv rvecc_decode.sv
read -sv channel_model.sv
read -sv top.sv
hierarchy -check -top top
prep -top top

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
